#+TITLE:  DySECT Project - Plotting Script
#+AUTHOR: Tobias Maier
#+EMAIL:  t.maier@kit.edu

** Common Stuff
#+BEGIN_SRC R :session

folder="../tests/130/"

# Hopscotch "forestgreen" pch=4
col_vec = list("dodgerblue2", "dodgerblue2",
               "red2", "red2",
               "darkorange", "darkorange",
               "black", "black")
pch_vec = list(16,16,17,17, 9, 9,15,15)
lty_vec = list( 2, 1, 2, 1, 2, 1, 2, 1)

lnames=c("DySECT", "Cuckoo", "Lin Prob", "Robin Hood")
lcol  =c("black", "dodgerblue2", "red2", "darkorange")
lpch  =c(15,16,17,9)
#+END_SRC

#+RESULTS:
| 15 |
| 16 |
| 17 |
|  9 |


**** Insert
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_insert.pdf :bg "white"

  pdf("plots/eps_insert.pdf", width=10, height=5)

  #header="Normalized Insertion Time"
  y='tin'
  x='eps'
  xrange <- range(0.8,1)
  yrange <- range(0,80) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor  ", delta)), line=2.3)
  title(ylab=expression(paste("time x ", (1-delta), "   [ns]")), line=2.3)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y]*(1.-datalines[[i]][,x]), col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.8, 75, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Find+
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_find_s.pdf :bg "white"

  pdf("plots/eps_find_s.pdf", width=5, height=4)
  x='eps'
  xrange <- range(0.8,1)

  #header="Successful Find Operation"
  y='tfi'
  yrange <- range(0,400) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor   ", delta)), line=2.3)
  title(ylab="time   [ns]", line=2.3)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y], col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]], cex=0.5)
  }

  legend(.8, 380, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Find-
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_find_u.pdf :bg "white"
  pdf("plots/eps_find_u.pdf", width=5, height=4)

  x='eps'
  xrange <- range(0.8,1)

  #header="Unsuccessful Find Operation"
  y='tfu'
  yrange <- range(0,400) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor   ", delta)), line=2.3)
  title(ylab="time   [ns]", line=2.3)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y], col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]], cex=0.5)
  }

  #legend(.8, 380, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Insert
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_insert.pdf :bg "white"

  pdf("pres_plots/eps_insert.pdf", width=6, height=4)

  #header="Normalized Insertion Time"
  y='tin'
  x='eps'
  xrange <- range(0.8,1)
  yrange <- range(0,94) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor  ", delta)), line=2.1)
  title(ylab=expression(paste("time x ", (1-delta), "   [ns]")), line=2.1)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y]*(1.-datalines[[i]][,x]),
          col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]], cex=0.6)
  }

  legend(.8, 89, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Find+
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_find_s.pdf :bg "white"

  pdf("pres_plots/eps_find_s.pdf", width=6, height=4)
  x='eps'
  xrange <- range(0.8,1)

  #header="Successful Find Operation"
  y='tfi'
  yrange <- range(0,400) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor   ", delta)), line=2.1)
  title(ylab="time   [ns]", line=2.1)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y],
          col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]], cex=0.6)
  }

  legend(.8, 380, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Find-
#+BEGIN_SRC R :session :results output
#graphics :file plots/eps_find_u.pdf :bg "white"
  pdf("pres_plots/eps_find_u.pdf", width=6, height=4)

  x='eps'
  xrange <- range(0.8,1)

  #header="Unsuccessful Find Operation"
  y='tfu'
  yrange <- range(0,400) #grows_bfs$fti)
  plot  (xrange, yrange, yaxs='i', col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("load factor   ", delta)), line=2.1)
  title(ylab="time   [ns]", line=2.1)

  for (i in 1:l)
  {
    lines(datalines[[i]][,x], datalines[[i]][,y],
          col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]], cex=0.6)
  }

  legend(.8, 380, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

*** Values from Experiment Section
#+begin_src R :session :results output
  extr <- function(d, al)
  {
    t <- d[(d$al == al) & (d$cap == 50000),]
    return ( t[,'tinf']/t[,'n_f']*1000000 )
  }
  tal = 1./0.85
  print("At 85% load")
  print(tal)
  c = extr(ti_ceipg, 1.17647)
  p = extr(ti_pinpl, 1.17647)
  print(c)
  print(p)
  print(1 - (c/p))
  print("At 97.5% load")
  c = extr(ti_ceipg, 1.02564)
  p = extr(ti_pinpl, 1.02564)
  p = extr(ti_cindp, 1.02564)
  print(c)
  print(p)
  print(1 - (c/p))

#+end_src

#+RESULTS:
: [1] "At 85% load"
: [1] 1.176471
: [1] 299.1987
: [1] 479.2026
: [1] 0.3756322
: [1] "At 97.5% load"
: [1] 1580.939
: [1] 4215.958
: [1] 0.6250107

**** Find+ Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_s.pdf :bg "white"
  pdf(file="plots/ti_find_s.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  header = "Find+ Microbenchmark"
  y='tfi0'
  yrange <- range(0,350) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,y] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 335, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find- Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_u.pdf :bg "white"
  pdf(file="plots/ti_find_u.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  header = "Find- Microbenchmark"
  y='tfi1'
  yrange <- range(0,350) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,'tfi1'] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  #legend(.85, 385, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Insert Benchmark
#+BEGIN_SRC R :session :results output
  #graphics :file plots/ti_insert.pdf :bg "white"
    pdf(file="plots/ti_insert.pdf", width=7, height=4)

    x='al'
    xrange <- range(.85,1)

    #header = "Insert Microbenchmark"
    y='tinf'
    yrange <- range(0, 300)
    plot  (xrange, yrange,
           yaxs='i',
           col="black", type="n", main=header, ann=FALSE)
    #title(main=header)
    title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
    title(ylab=expression(paste("time x ", (1-delta[min]), "   [ns]")), line=2.3)

    for (i in 1:ti_l)
    {
      epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
      yline   <- ti_datalines[[i]][,y]/ti_datalines[[i]][,'n_f']*1000000*epsilon
      lines(1-epsilon, yline , col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
    }

    legend(.85, 290, lnames, lty=1, col=lcol, pch=lpch)

    dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find+ Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_s.pdf :bg "white"
  pdf(file="pres_plots/ti_find_s.pdf", width=6, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find+ Microbenchmark"
  y='tfi0'
  yrange <- range(0,350) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.1)
  title(ylab="time per op    [ns]", line=2.1)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,y] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 335, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find- Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_u.pdf :bg "white"
  pdf(file="pres_plots/ti_find_u.pdf", width=6, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find- Microbenchmark"
  y='tfi1'
  yrange <- range(0,350) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.1)
  title(ylab="time per op    [ns]", line=2.1)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,'tfi1'] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  #legend(.85, 385, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Insert Benchmark
#+BEGIN_SRC R :session :results output
  #graphics :file plots/ti_insert.pdf :bg "white"
    pdf(file="pres_plots/ti_insert.pdf", width=6, height=4)

    x='al'
    xrange <- range(.85,1)

    #header = "Insert Microbenchmark"
    y='tinf'
    yrange <- range(0, 330)
    plot  (xrange, yrange,
           yaxs='i',
           col="black", type="n", main=header, ann=FALSE)
    #title(main=header)
    title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.1)
    title(ylab=expression(paste("time x ", (1-delta[min]), "   [ns]")), line=2.1)

    for (i in 1:ti_l)
    {
      epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
      yline   <- ti_datalines[[i]][,y]/ti_datalines[[i]][,'n_f']*1000000*epsilon
      lines(1-epsilon, yline , col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
    }

    legend(.85, 320, lnames, lty=1, col=lcol, pch=lpch)

    dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1


*** Shared Plot

#+BEGIN_SRC R :session :results output
#graphics :file plots/crawl.pdf :bg "white"

  pdf(file="plots/crawl.pdf", width=5, height=4.3)

  datalines = list(#f_err(f_ctable(cw_simpl,  1,8,3)),
                   f_err(f_ctable(cw_cindp,256,8,3)),
                   f_err(f_ctable(cw_cinpl,  1,8,3)),

                   #f_err(cw_sprob),
                   f_err(cw_strcp),
                   f_err(cw_pinpl),

                   #f_err(cw_rprob),
                   f_err(cw_strcr),
                   f_err(cw_riprb),

                   f_err(f_ctable(cw_egrow,256,8,3)),
                   f_err(f_ctable(cw_ceipg,256,8,3))
)

  l=length(datalines)

  par(mfrow=c(1,1))

  y='time'
  x='al'
  xrange <- range(.85, 1)
  yrange <- range(0,800) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="Time per operation   [ns]", line=2.3)

  for (i in 1:l)
  {
    xline <- 1.- (datalines[[i]][,x]-1.)/datalines[[i]][,x]
    yline <- datalines[[i]][,y]/(datalines[[i]][,'mult'] + datalines[[i]][,'ind']) *1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 750, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

*** Presentation Plot

#+BEGIN_SRC R :session :results output
#graphics :file plots/crawl.pdf :bg "white"

  pdf(file="pres_plots/crawl.pdf", width=4.8, height=3.8)

  datalines = list(#f_err(f_ctable(cw_simpl,  1,8,3)),
                   f_err(f_ctable(cw_cindp,256,8,3)),
                   f_err(f_ctable(cw_cinpl,  1,8,3)),

                   #f_err(cw_sprob),
                   f_err(cw_strcp),
                   f_err(cw_pinpl),

                   #f_err(cw_rprob),
                   f_err(cw_strcr),
                   f_err(cw_riprb),

                   f_err(f_ctable(cw_egrow,256,8,3)),
                   f_err(f_ctable(cw_ceipg,256,8,3))
)

  l=length(datalines)

  par(mfrow=c(1,1))

  y='time'
  x='al'
  xrange <- range(.85, 1)
  yrange <- range(0,800) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.1)
  title(ylab="Time per operation   [ns]", line=2.1)

  for (i in 1:l)
  {
    xline <- 1.- (datalines[[i]][,x]-1.)/datalines[[i]][,x]
    yline <- datalines[[i]][,y]/(datalines[[i]][,'mult'] + datalines[[i]][,'ind']) *1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 750, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

*** Shared Plot
#+BEGIN_SRC R :session :results output
  #graphics :file plots/mix.pdf :bg "white"

    pdf("plots/mix.pdf", width=5, height=4)

    tcap=50000
    tal =1.05263
    datalines = list(#f_ierr(f_al(f_cap(f_ctable(mx_simpl,  1,8,3), tcap), tal)),
                     f_ierr(f_al(f_cap(f_ctable(mx_cindp,256,8,3), tcap), tal)),
                     f_ierr(f_al(f_cap(f_ctable(mx_cinpl,  1,8,3), tcap), tal)),

                     #f_ierr(f_al(f_cap(mx_sprob, tcap), tal)),
                     f_ierr(f_al(f_cap(mx_strcp, 200000), tal)),
                     f_ierr(f_al(f_cap(mx_pinpl, tcap), tal)),

                     #f_ierr(f_al(f_cap(mx_rprob, tcap), tal)),
                     f_ierr(f_al(f_cap(mx_strcr, 200000), tal)),
                     f_ierr(f_al(f_cap(mx_riprb, tcap), tal)),

                     f_ierr(f_al(f_cap(f_ctable(mx_egrow,256,8,3), tcap), tal)),
                     f_ierr(f_al(f_cap(f_ctable(mx_ceipg,256,8,3), tcap), tal))

                     #f_al(f_cap(f_htable(mx_shops, 62), tcap), tal)
  )

    l=length(datalines)

    par(mfrow=c(1,1))  #two plots next to each other

    #header = "Mixed Tests Insert and Successful Finds"
    y='ttmix'
    x='pat'
    xrange <- range(0,100)
    yrange <- range(0, 3500)
    plot  (x=NULL, y=NULL, xlim=xrange, ylim=yrange,
           xaxs='i', yaxs='i',
           col="black", type="n", main=header, ann=FALSE)
    #title(main=header)
    title(xlab="fraction of insert operations   [%]", line=2.3)
    title(ylab="time per operation   [ns]", line=2.3)
    for (i in 1:l)
    {
      xline <- datalines[[i]][,x] * 10
      yline <- datalines[[i]][,y]
      lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
    }

    legend(2, 3400, lnames, lty=1, col=lcol, pch=lpch)

    dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

*** Shared Plot
#+BEGIN_SRC R :session :results output
#graphics :file plots/mix.pdf :bg "white"

  pdf("plots/mixd.pdf", width=5, height=4)

  tcap=50000
  tal =1.05263
  datalines = list(#f_ierr(f_al(f_cap(f_ctable(md_simpl,  1,8,3), tcap), tal)),
                   f_ierr(f_al(f_cap(f_ctable(md_cindp,256,8,3), tcap), tal)),
                   f_ierr(f_al(f_cap(f_ctable(md_cinpl,  1,8,3), tcap), tal)),

                   #f_ierr(f_al(f_cap(md_sprob, tcap), tal)),
                   f_ierr(f_al(f_cap(md_strcp, 200000), tal)),
                   f_ierr(f_al(f_cap(md_pinpl, tcap), tal)),

                   #f_ierr(f_al(f_cap(md_rprob, tcap), tal)),
                   f_ierr(f_al(f_cap(md_strcr, 200000), tal)),
                   f_ierr(f_al(f_cap(md_riprb, tcap), tal)),

                   f_ierr(f_al(f_cap(f_ctable(md_egrow,256,8,3), tcap), tal)),
                   f_ierr(f_al(f_cap(f_ctable(md_ceipg,256,8,3), tcap), tal))

#                   f_al(f_cap(f_htable(md_shops, 62), tcap), tal)
)

  l=length(datalines)

  par(mfrow=c(1,1))  #two plots next to each other

  #header = "Mixed Tests Insert and Erase"
  y='ttmix'
  x='pat'
  xrange <- range(50,100)
  yrange <- range(0, 3500)
  plot  (x=NULL, y=NULL, xlim=xrange, ylim=yrange,
         xaxs='i', yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab="fraction of insert operations   [%]", line=2.3)
  title(ylab="time per operation   [ns]", line=2.3)
  for (i in 1:l)
  {
    xline <- datalines[[i]][,x] * 10
    yline <- datalines[[i]][,y]
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  #legend(52, 5400, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

*** Shared Plot

#+BEGIN_SRC R :session :results output
  #graphics :file plots/crawl.pdf :bg "white"

    pdf(file="plots/lru.pdf", width=10, height=4)

    datalines = list(f_err(f_ctable(dw_egrow,256,8,3)),
                     f_err(f_ctable(dw_ceipg,256,8,3)),

                     f_err(f_ctable(dw_simpl,  1,8,3)),
                     f_err(f_ctable(dw_cinpl,  1,8,3)),

                     f_err(dw_sprob),
                     f_err(dw_pinpl),

                     f_err(dw_rprob),
                     f_err(dw_riprb))

    l=length(datalines)

    par(mfrow=c(1,1))

    header = "Least Recently Used"
    y='t_mix'
    x='al'
    xrange <- range(.85, 1)
    yrange <- range(0,1500) #grows_bfs$fti)
    plot  (xrange, yrange,
           yaxs='i',
           col="black", type="n", main=header, ann=FALSE)
    title(main=header)
    title(xlab=expression(paste("load  ", 1-1/epsilon)))
    title(ylab="Time per operation   in ns")

    for (i in 1:l)
    {
      xline <- 1.- (datalines[[i]][,x]-1.)/datalines[[i]][,x]
      yline <- datalines[[i]][,y]/(datalines[[i]][,'n_mix'])*1000000
      lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
    }

    legend(.977, 750, lnames, lty=1, col=lcol, pch=lpch)

    dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1


** Common Stuff
#+BEGIN_SRC R :session

  folder="../tests/130/special/"

  # Hopscotch "forestgreen" pch=4
  col_vec = list("forestgreen",
                 "violet",
                 "skyblue",
                 "black",
                 "forestgreen",
                 "violet",
                 "skyblue",
                 "black")
  pch_vec = list(15,15,15,15, 16,16,16,16)
  lty_vec = list( 1, 1, 1, 1,  2, 2, 2, 2)

  lnames=c("8/3", "8/2", "4/3", "4/2")
  lcol  =c("black"     , "forestgreen", "violet", "skyblue")
  #lpch  =c(1,16,16,16)
#+END_SRC

#+RESULTS:
| black       |
| forestgreen |
| violet      |
| skyblue     |

**** Find+ Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_s.pdf :bg "white"
  pdf(file="plots/param_find_s.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find+ Microbenchmark"
  y='tfi0'
  yrange <- range(0,140) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,y] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.965, 70, lnames, lty=1, col=lcol)
  legend(.905, 44, c("DySECT", "Cuckoo"), lty=c(1,2), col="black", pch=c(15,16))

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find- Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_u.pdf :bg "white"
  pdf(file="plots/param_find_u.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find- Microbenchmark"
  y='tfi1'
  yrange <- range(0,140) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,'tfi1'] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  #legend(.85, 385, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Insert Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_insert.pdf :bg "white"
  pdf(file="plots/param_insert.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Insert Microbenchmark"
  y='tinf'
  yrange <- range(0, 320)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab=expression(paste("time x ", (1-delta[min]), "   [ns]")), line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    yline   <- ti_datalines[[i]][,y]/ti_datalines[[i]][,'n_f']*1000000*epsilon
    lines(1-epsilon, yline , col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 310, lnames, lty=1, col=lcol)
  legend(.893,310, c("DySECT", "Cuckoo"), lty=c(1,2), col="black", pch=c(15,16))

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find+ Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_s.pdf :bg "white"
  pdf(file="pres_plots/param_find_s.pdf", width=4, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find+ Microbenchmark"
  y='tfi0'
  yrange <- range(0,140) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,y] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.94, 70, lnames, lty=1, col=lcol)
  legend(.85, 44, c("DySECT", "Cuckoo"), lty=c(1,2), col="black", pch=c(15,16))

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

**** Find- Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_find_u.pdf :bg "white"
  pdf(file="plots/param_find_u.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Find- Microbenchmark"
  y='tfi1'
  yrange <- range(0,140) #grows_bfs$fti)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab="time per op    [ns]", line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    xline   <- 1.-epsilon
    yline   <- ti_datalines[[i]][,'tfi1'] / ti_datalines[[i]][,'n_f']*1000000
    lines(xline, yline, col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  #legend(.85, 385, lnames, lty=1, col=lcol, pch=lpch)

  dev.off()
#+END_SRC

#+RESULTS:
: null device
:           1

**** Insert Benchmark
#+BEGIN_SRC R :session :results output
#graphics :file plots/ti_insert.pdf :bg "white"
  pdf(file="pres_plots/param_insert.pdf", width=4, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Insert Microbenchmark"
  y='tinf'
  yrange <- range(0, 350)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab=expression(paste("time x ", (1-delta[min]), "   [ns]")), line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    yline   <- ti_datalines[[i]][,y]/ti_datalines[[i]][,'n_f']*1000000*epsilon
    lines(1-epsilon, yline , col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85, 340, lnames, lty=1, col=lcol)
  legend(.91, 340, c("DySECT", "Cuckoo"), lty=c(1,2), col="black", pch=c(15,16))

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1


** Common Stuff
#+BEGIN_SRC R :session

  folder="../tests/130/special/"

  # Hopscotch "forestgreen" pch=4
  col_vec = list("gray",
                 "brown",
                 "black",
                 "gray",
                 "brown",
                 "black")
  pch_vec = list(15,15,15,16,16,16)
  lty_vec = list( 1, 1, 1, 2, 2, 2)

  lnames=c("bfs", "opt-rwalk", "pess-rwalk")
  lcol  =c("black", "brown", "gray")
  #lpch  =c(1,16,16,16)
#+END_SRC

#+RESULTS:
| black |
| brown |
| gray  |

*** Plot
#+BEGIN_SRC R :session :results output
  tcap=50000

  ti_datalines = list(
                   f_ierr(f_cap(f_ctable(ti_ceipgp,256,8,3), tcap)),
                   f_ierr(f_cap(f_ctable(ti_ceipgo,256,8,3), tcap)),
                   f_ierr(f_cap(f_ctable(ti_ceipgb,256,8,3), tcap)),
                   f_ierr(f_cap(f_ctable(ti_cinplp,  1,8,3), tcap)),
                   f_ierr(f_cap(f_ctable(ti_cinplo,  1,8,3), tcap)),
                   f_ierr(f_cap(f_ctable(ti_cinplb,  1,8,3), tcap))
                   )

  ti_l = length(ti_datalines)

  pdf(file="plots/disp_insert.pdf", width=5, height=4)

  x='al'
  xrange <- range(.85,1)

  #header = "Insert Microbenchmark"
  y='tinf'
  yrange <- range(0, 320)
  plot  (xrange, yrange,
         yaxs='i',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("enforced min load   ", delta[min])), line=2.3)
  title(ylab=expression(paste("time x ", (1-delta[min]), "   [ns]")), line=2.3)

  for (i in 1:ti_l)
  {
    epsilon <- (ti_datalines[[i]][,'al']-1.)/ti_datalines[[i]][,'al']
    yline   <- ti_datalines[[i]][,y]/ti_datalines[[i]][,'n_f']*1000000*epsilon
    lines(1-epsilon, yline , col=col_vec[[i]], type="o", pch=pch_vec[[i]], lty=lty_vec[[i]])
  }

  legend(.85,  310, lnames, lty=1, col=lcol)
  legend(.918, 310, c("DySECT", "Cuckoo"), lty=c(1,2), col="black", pch=c(15,16) )

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1

** Read Data
#+begin_src R :session :results output
  folder = "../tests/130/fill/"
  colc <- c('it', 'cap', 'n', 'steps', 'ngrow', 'bs', 'tl', 'nh', 'f_cap', 'elem')

  fl_ceipg_raw      <- read.table(paste(folder, "tceipg2l" , sep="") , comment.char = "#", col.names = colc)
  fl_ceg2l_raw      <- read.table(paste(folder, "tceg2l"   , sep="") , comment.char = "#", col.names = colc)
  fl_simpl_raw      <- read.table(paste(folder, "tcsimple" , sep="") , comment.char = "#", col.names = colc)
  fl_cinpl_raw      <- read.table(paste(folder, "tcinplace", sep="") , comment.char = "#", col.names = colc)

  d <- fl_ceipg_raw
  fl_ceipg = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$ngrow, d$steps), FUN=mean)
  d <- fl_ceg2l_raw
  fl_ceg2l = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$ngrow, d$steps), FUN=mean)
  d <- fl_simpl_raw
  fl_simpl = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$ngrow, d$steps), FUN=mean)
  d <- fl_cinpl_raw
  fl_cinpl = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$ngrow, d$steps), FUN=mean)
#+end_src

#+RESULTS:

#+BEGIN_SRC R :session :results output
   d <- fl_ceg2l
   d$load = d$elem / d$f_cap
   d$growval = 2**(pracma::nextpow2((d$f_cap / d$tl)+1)-1)
   d$eff_cap = d$f_cap + d$growval
   d$eff_load= d$elem / d$eff_cap
   fl_ceg2l <- d
   fl_ceg2l_min  = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$steps), FUN=min)

   d <- fl_ceipg
   d$load = d$elem / d$f_cap
   d$growval = 2**(pracma::nextpow2((d$f_cap / d$tl)+1)-1)
   d$eff_cap = d$f_cap + d$growval
   d$eff_load= d$elem / d$eff_cap
   fl_ceipg <- d
   fl_ceipg_min  = aggregate(d, by=list(d$bs, d$tl, d$nh, d$cap, d$n, d$steps), FUN=min)

   d <- fl_simpl
   d$load = d$elem / d$f_cap
   d$growval = 0
   d$eff_cap = d$f_cap
   d$eff_load= d$elem / d$eff_cap
   fl_simpl <- d

   d <- fl_cinpl
   d$load = d$elem / d$f_cap
   d$growval = 0
   d$eff_cap = d$f_cap
   d$eff_load= d$elem / d$eff_cap
   fl_cinpl <- d
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :session :results output
#install.packages("pracma")
#install.packages("ifutools")
#print(fl_ceg2l$growval[1:5])
print (fl_ceg2l_min[(fl_ceg2l_min$steps == 16384) & (fl_ceg2l_min$tl == 4096),c('bs','nh','load','eff_load')])
print (fl_ceipg_min[(fl_ceipg_min$steps == 16384) & (fl_ceipg_min$tl == 4096),c('bs','nh','load','eff_load')])
print (fl_simpl[(fl_simpl$steps == 16384),c('bs','nh','load')])
print (fl_cinpl[(fl_cinpl$steps == 16384),c('bs','nh','load')])
#+END_SRC

#+RESULTS:
=   bs nh      load  eff_load
29  4  2 0.9274274 0.9272584
30  8  2 0.9667746 0.9665832
35  4  3 0.9891705 0.9889700
36  8  3 0.9973106 0.9970931
   bs nh      load  eff_load
29  4  2 0.9274274 0.9272584
30  8  2 0.9667746 0.9665832
35  4  3 0.9891705 0.9889700
36  8  3 0.9973106 0.9970931
   bs nh      load
9   4  2 0.9779280
10  8  2 0.9970079
11  4  3 0.9984292
12  8  3 0.9998222
   bs nh      load
9   4  2 0.9779280
10  8  2 0.9970079
11  4  3 0.9984292
12  8  3 0.9998222

#+BEGIN_SRC R :session :results output
#install.packages("pracma")
#install.packages("ifutools")
#print(fl_ceg2l$growval[1:5])
d <- fl_ceipg[(fl_ceipg$tl==4096)& (fl_ceipg$steps == 16384) & (fl_ceipg$bs==4) & (fl_ceipg$nh==2),c('eff_load', 'load', 'ngrow')]
d$shortest <- apply(df[,2:4],1,min)
#+END_SRC


** Plot over ngrow Benchmark

#+BEGIN_SRC R :session :results output

  datalines = list(
                fl_ceipg#,
              #  fl_ceg2l
              )
  z=0.002

  py <- function(y) { return (1./((1+z)-y))}

  lnames=c("8/3", "8/2", "4/3", "4/2")
  lcol  =c("black", "forestgreen", "violet", "skyblue")

  pdf(file="plots/load_bound.pdf", width=4.7, height=3.3)

  #header = "Find+ Microbenchmark"
  y='tfi0'
  yrange <- range(py(c(.885, 1.)))
  xrange <- range(50000, 20000000)

  par(mar=c(4, 4, 1, 4) + 0.1)

  plot  (xrange, yrange, log='xy',
         yaxs='i', xaxt='n', yaxt='n',
         col="black", type="n", main=header, ann=FALSE)
  #title(main=header)
  title(xlab=expression(paste("number of cells   ", m)), line=2.1)
  title(ylab=expression(paste("max load   "  , delta)), line=2.8)

  xticks <- 2^seq(16,24, by=1)
  xsticks <- seq(16,24, by=2)
  xlabs  <- sapply(xsticks, function(i) {as.expression(bquote(2^.(i)))})
  xsticks <- 2^xsticks
  axis(1, at=xticks,  labels=FALSE)
  axis(1, at=xsticks, labels=xlabs)

  yticks <- append(seq(.9,1.,0.01), seq(.99,1.,0.001))
  ysticks <- c(0.9, 0.99, 0.999, 1)
  ylabs  <-  ysticks #c(expression(1-10^-1), expression(1-10^-2),expression(1-10^-3), 1) sapply(xsticks, function(i) {as.expression(bquote(10^.(i)))})
  ysticks <- py(ysticks)
  yticks <-  py(yticks)
  axis(2, at=yticks,  labels=FALSE, tck=-.025)
  axis(2, at=ysticks, labels=ylabs, las=1)

  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==4) & (fl_cinpl$nh==2), 'load']
  axis(4, at=py(b), labels=round(b, digits=3),
          col.axis="skyblue", cex.axis=.8, las=2, tck=-.025)

  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==4) & (fl_cinpl$nh==3), 'load']
  axis(4, at=py(b), labels=round(b, digits=3),
          col.axis="violet", cex.axis=.8, las=2, tck=-.025)

  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==8) & (fl_cinpl$nh==2), 'load']
  axis(4, at=py(b-.00045), labels=round(b, digits=3),
          col.axis="forestgreen", cex.axis=.8, las=2, tck=-.0)
  axis(4, at=py(b), labels='',
          col.axis="forestgreen", cex.axis=.8, las=2, tck=-.025)

  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==8) & (fl_cinpl$nh==3), 'load']
  axis(4, at=py(b), labels=round(b, digits=4),
          col.axis="black", cex.axis=.8, las=2, tck=-.025)

  b <- fl_ceipg_min[(fl_ceipg_min$steps==16384) & (fl_ceipg_min$bs==4) & (fl_ceipg_min$nh==2) & (fl_ceipg_min$tl==4096), 'load']
  axis(4, at=py(b), labels=round(b, digits=3),
          col.axis="skyblue", cex.axis=.8, las=2, tck=-.025)

  b <- fl_ceipg_min[(fl_ceipg_min$steps==16384) & (fl_ceipg_min$bs==4) & (fl_ceipg_min$nh==3) & (fl_ceipg_min$tl==4096), 'load']
  axis(4, at=py(b), labels=round(b, digits=3),
          col.axis="violet", cex.axis=.8, las=2, tck=-.025)

  b <- fl_ceipg_min[(fl_ceipg_min$steps==16384) & (fl_ceipg_min$bs==8) & (fl_ceipg_min$nh==2) & (fl_ceipg_min$tl==4096), 'load']
  axis(4, at=py(b), labels=round(b, digits=3),
          col.axis="forestgreen", cex.axis=.8, las=2, tck=-.025)

  b <- fl_ceipg_min[(fl_ceipg_min$steps==16384) & (fl_ceipg_min$bs==8) & (fl_ceipg_min$nh==3) & (fl_ceipg_min$tl==4096), 'load']
  axis(4, at=py(b+.0003), labels=round(b, digits=3),
          col.axis="black", cex.axis=.8, tck=.0, las=2)
  axis(4, at=py(b), labels='',
          col.axis="black", cex.axis=.8, las=2, tck=-.025)


  d <- fl_ceipg
  d <- d[(d$steps==16384) & (d$tl==4096) & (d$bs == 4) & (d$nh == 2),]
  xline   <- d[,'eff_cap']
  yline   <- d[,'eff_load']
  lines(xline, py(yline), col="skyblue")

  d <- fl_ceipg
  d <- d[(d$steps==16384) & (d$tl==4096) & (d$bs == 4) & (d$nh == 3),]
  xline   <- d[,'eff_cap']
  yline   <- d[,'eff_load']
  lines(xline, py(yline), col="violet")

  d <- fl_ceipg
  d <- d[(d$steps==16384) & (d$tl==4096) & (d$bs == 8) & (d$nh == 2),]
  xline   <- d[,'eff_cap']
  yline   <- d[,'eff_load']
  lines(xline, py(yline), col="forestgreen")

  d <- fl_ceipg
  d <- d[(d$steps==16384) & (d$tl==4096) & (d$bs == 8) & (d$nh == 3),]
  xline   <- d[,'eff_cap']
  yline   <- d[,'eff_load']
  lines(xline, py(yline), col="black")

  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==4) & (fl_cinpl$nh==2), 'load']
  lines(xrange+c(0,100000000), py(c(b,b)), col="skyblue", lty=2)
  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==4) & (fl_cinpl$nh==3), 'load']
  lines(xrange+c(0,100000000), py(c(b,b)), col="violet", lty=2)
  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==8) & (fl_cinpl$nh==2), 'load']
  lines(xrange+c(0,100000000), py(c(b,b)), col="forestgreen", lty=2)
  b <- fl_cinpl[(fl_cinpl$steps==16384) & (fl_cinpl$bs==8) & (fl_cinpl$nh==3), 'load']
  lines(xrange+c(0,100000000), py(c(b,b)), col="black", lty=2)

  legend(50000, py(0.984), lnames, col=lcol, lty=1, bg='white')

  dev.off()

#+END_SRC

#+RESULTS:
: null device
:           1
